; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	thermograph2 - mode
	infrared1 - mode
	thermograph0 - mode
	spectrograph3 - mode
	Star0 - direction
	Star4 - direction
	Star1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star3 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star5)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
)
(:goal (and
	(pointing satellite2 Star10)
	(pointing satellite3 Star1)
	(pointing satellite4 Star8)
	(have_image Phenomenon6 thermograph0)
	(have_image Star7 spectrograph3)
	(have_image Star8 thermograph2)
	(have_image Phenomenon9 thermograph0)
	(have_image Star10 thermograph2)
))

)

; plan
1. (turn_to satellite4 star3 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 star3)
   goals met: 0 of 8
2. (switch_on instrument4 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (calibrate satellite4 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 0 of 8
4. (turn_to satellite4 phenomenon6 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 phenomenon6)
   goals met: 0 of 8
5. (turn_to satellite2 star10 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star10)
   goals met: 1 of 8
6. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 1 of 8
7. (take_image satellite4 phenomenon6 instrument4 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 2 of 8
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
9. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 8
10. (turn_to satellite0 star10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star10)
   goals met: 2 of 8
11. (take_image satellite0 star10 instrument0 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 3 of 8
12. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 3 of 8
13. (take_image satellite0 star7 instrument0 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 4 of 8
14. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 4 of 8
15. (take_image satellite0 star8 instrument0 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 5 of 8
16. (turn_to satellite3 star1 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star1)
   goals met: 6 of 8
17. (turn_to satellite4 phenomenon9 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon9)
   goals met: 6 of 8
18. (take_image satellite4 phenomenon9 instrument4 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 7 of 8
19. (turn_to satellite4 star8 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 star8)
   goals met: 8 of 8
